Revit 2026 API

# SubelementIsValidType Method

---

Checks if given type is valid for this subelement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidType(
	ElementId typeId
)
```
```vb
Public Function IsValidType (
	typeId As ElementId
) As Boolean
```
```cpp
public:
bool IsValidType(
	ElementId^ typeId
)
```
```fsharp
member IsValidType :
        typeId : ElementId -> bool
```

#### Parameters

typeId ElementId
     ElementId of the type to check.

#### Return Value

Boolean True if subelement can have a type assigned and this type is valid for this subelement, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A type is valid for a subelement if it can be assigned to the subelement.

#### Reference

Subelement Class

Autodesk.Revit.DB Namespace